tests/performance/change-password.artillery.yml
config:
  target: "http://209.25.140.25:9242"
  phases:
    - name: "Warm-up"
      duration: 20
      arrivalRate: 3
    - name: "Ramp-up"
      duration: 30
      arrivalRate: 5
      rampTo: 15
    - name: "Sustained load"
      duration: 30
      arrivalRate: 15
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Change password endpoint load (non-destructive)"
    flow:
      - put:
          url: "/api/change-password/"
          json:
            userId: "7"
            currentPassword: "InvalidCurrentForPerf"
            newPassword: "PerfTest123*"